tutorials/multiphase/interFoam/ras/damBreakPorousBaffle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    rightWall
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    lowerWall
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    porous_half0
    {
        type            porousBafflePressure;
        patchType       cyclic;
        jump            uniform 0;
        D               700;
        I               500;
        length          1.05;
        value           uniform 0;
    }
    porous_half1
    {
        type            porousBafflePressure;
        patchType       cyclic;
        jump            uniform 0;
        D               700;
        I               500;
        length          1.05;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
